import { Container, Grid } from "@mui/material";
import React from "react";
import Question from "./Question";
import SearchBar from "./SearchBar";

const quesions = [
    {
      "question": "מהי קבוצת רכישה ואיך היא עובדת?",
      "answer": "קבוצת רכישה היא קבוצה של אנשים שמתאגדים יחד במטרה לרכוש קרקע ולבנות עליה פרויקט נדל\"ן, כמו בניין מגורים או מסחרי. היתרון בקבוצת רכישה הוא שהחברים בקבוצה יכולים להשיג תנאים טובים יותר מבחינת עלויות הקרקע והבנייה, וכן ליהנות מהוזלות נוספות בזכות הכוח הקולקטיבי של הקבוצה."
    },
    {
      "question": "מהם היתרונות בהשקעה בקבוצת רכישה לעומת רכישה פרטית?",
      "answer": "היתרונות כוללים הוזלות בעלויות, אפשרות לקבלת תנאים טובים יותר מהמוכרים ומהקבלנים, פיזור סיכונים בין חברי הקבוצה, וכן גישה לפרויקטים שלא תמיד זמינים לרוכשים פרטיים. כמו כן, בקבוצת רכישה ישנה שקיפות גבוהה יותר בתהליך הרכישה והבנייה."
    },
    {
      "question": "מהם הסיכונים הכרוכים בהשקעה בקבוצת רכישה?",
      "answer": "הסיכונים כוללים אפשרות לאי עמידה בלוחות הזמנים או בתקציב, בעיות ברישוי ובאישורים, וכן סיכון של חוסר הסכמה בין חברי הקבוצה בנוגע להחלטות חשובות. בנוסף, ישנם סיכונים משפטיים ופיננסיים שנובעים מהתאגדות קבוצתית ואחריות קולקטיבית."
    },
    {
      "question": "מהם השלבים העיקריים בתהליך ההשקעה בקבוצת רכישה?",
      "answer": "התהליך מתחיל בגיבוש הקבוצה ובחירת יזם או עורך דין לניהול הפרויקט. לאחר מכן, מתבצעת רכישת הקרקע, גיבוש התוכניות האדריכליות וקבלת האישורים הנדרשים. בשלב הבא מתבצעת בניית הפרויקט, ובסיום הבנייה מתבצעת חלוקת היחידות בין חברי הקבוצה בהתאם להסכמים שנקבעו מראש."
    }
  ]


const Info = () => {
    return (
        <Container>
            <Grid>
                {
                    quesions.map(({question, answer}) => 
                        <Question question={question} answer={answer} />)
                }
            </Grid>
            <br />
            <Grid>
                <SearchBar />
            </Grid>
        </Container>
    )
}

export default Info